onvif/GetVideoEncoderConf.xml

<?xml version='1.0' encoding='utf-8'?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema"><s:Header>%s</s:Header><s:Body><trt:GetVideoEncoderConfiguration>      <trt:ConfigurationToken>%s</trt:ConfigurationToken></trt:GetVideoEncoderConfiguration></s:Body></s:Envelope>