messages/ws_get_snapshot_uri.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
    <soap:Body>
        <trt:GetSnapshotUri>
            <trt:ProfileToken>%1$s</trt:ProfileToken>
        </trt:GetSnapshotUri>
    </soap:Body>
</soap:Envelope>
