SOAP/GetStreamUri.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username></Username>
                <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></Password>
                <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"></Nonce>
                <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"></Created>
            </UsernameToken>
        </Security>
    </soap:Header>
    <soap:Body>
        <GetStreamUri xmlns="http://www.onvif.org/ver10/media/wsdl">
            <ProfileToken>000</ProfileToken>
            <StreamType>RTP-Unicast</StreamType>
            <TransportProtocol>UDP</TransportProtocol>
        </GetStreamUri>
    </soap:Body>
</soap:Envelope>
